levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_clk.c
/**
 *******************************************************************************
 * @file  hc32m423_clk.c
 * @brief This file provides firmware functions to manage the Clock(CLK).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2019-06-24       Chengy          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32m423_clk.h"
#include "hc32m423_utility.h"

/**
 * @addtogroup HC32M423_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_CLK CLK
 * @brief Clock Driver Library
 * @{
 */

#if (DDL_CLK_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup CLK_Local_Macros CLK Local Macros
 * @{
 */

#define CLK_TIMEOUT             (0x1000U)
#define CLK_XTAL_TIMEOUT        (0x20000U)
#define CLK_PLL_TIMEOUT         (0x80000U)

#define CLK_PLL_DIV_MIN         (2U)
#define CLK_PLL_DIV_MAX         (4U)

#define CLK_PLLN_MIN            (10U)
#define CLK_PLLN_MAX            (60U)

#define CLK_PLLM_MIN            (1U)
#define CLK_PLLM_MAX            (8U)


#define CLK_PLL_VCO_IN_MIN                  (4U*1000U*1000U)
#define CLK_PLL_VCO_IN_MAX                  (125U*100U*1000U)

#define CLK_PLL_VCO_OUT_MIN                 (120U*1000U*1000U)
#define CLK_PLL_VCO_OUT_MAX                 (240U*1000U*1000U)

/**
 * @defgroup RTC_Check_Parameters_Validity RTC Check Parameters Validity
 * @{
 */
/* Paramer valid check for XTAL state */
#define IS_VALID_CLK_XTAL_STATE(STA)                                           \
(       ((STA) == CLK_XTAL_OFF)                     ||                         \
        ((STA) == CLK_XTAL_ON))

/* Paramer valid check for XTAL mode */
#define IS_VALID_CLK_XTAL_MODE(MODE)                                           \
(       ((MODE) == CLK_XTALMODE_OSC)                ||                         \
        ((MODE) == CLK_XTALMODE_EXCLK))

/* Paramer valid check for XTAL super driver state */
#define IS_VALID_CLK_XTAL_SUPDRV_STATE(STA)                                    \
(       ((STA) == CLK_XTAL_SUPDRV_ON)               ||                         \
        ((STA) == CLK_XTAL_SUPDRV_OFF))

/* Paramer valid check for XTAL driver ability mode */
#define IS_VALID_CLK_XTALDRV_MODE(MODE)                                        \
(       ((MODE) == CLK_XTALDRV_HIGH)                ||                         \
        ((MODE) == CLK_XTALDRV_MID)                 ||                         \
        ((MODE) == CLK_XTALDRV_LOW)                 ||                         \
        ((MODE) == CLK_XTALDRV_ULOW))

/* Paramer valid check for XTAL stable time selection */
#define IS_VALID_CLK_XTALSTB_SEL(SEL)                                          \
(       ((SEL) == CLK_XTALSTB_8)                    ||                         \
        ((SEL) == CLK_XTALSTB_9 )                   ||                         \
        ((SEL) == CLK_XTALSTB_10)                   ||                         \
        ((SEL) == CLK_XTALSTB_11)                   ||                         \
        ((SEL) == CLK_XTALSTB_13)                   ||                         \
        ((SEL) == CLK_XTALSTB_15)                   ||                         \
        ((SEL) == CLK_XTALSTB_16)                   ||                         \
        ((SEL) == CLK_XTALSTB_17))

