levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_clk.c
/* Paramer valid check for XTALSTD state */
#define IS_VALID_CLK_XTALSTD_STATE(STA)                                        \
(       ((STA) == CLK_XTALSTD_OFF)                  ||                         \
        ((STA) == CLK_XTALSTD_ON))

/* Paramer valid check for XTALSTD mode */
#define IS_VALID_CLK_XTALSTD_MODE(MD)                                          \
(       ((MD) == CLK_XTALSTD_MODE_RST)            ||                           \
        ((MD) == CLK_XTALSTD_MODE_INT))

/* Paramer valid check for XTALSTD interrupt state */
#define IS_VALID_CLK_XTALSTD_INT_STATE(STA)                                    \
(       ((STA) == CLK_XTALSTD_INT_OFF)              ||                         \
        ((STA) == CLK_XTALSTD_INT_ON))

/* Paramer valid check for XTALSTD reset state */
#define IS_VALID_CLK_XTALSTD_RST_STATE(STA)                                    \
(       ((STA) == CLK_XTALSTD_RST_OFF)              ||                         \
        ((STA) == CLK_XTALSTD_RST_ON))

/* Paramer valid check for HRC state */
#define IS_VALID_CLK_HRC_STATE(STA)                                            \
(       ((STA) == CLK_HRC_OFF)                      ||                         \
        ((STA) == CLK_HRC_ON))

/* Paramer valid check for HRC state */
#define IS_VALID_CLK_HRC_FREQ_SEL(SEL)                                         \
 (      ((SEL) == CLK_HRCFREQ_32)                   ||                         \
        ((SEL) == CLK_HRCFREQ_16)                   ||                         \
        ((SEL) == CLK_HRCFREQ_8)                    ||                         \
        ((SEL) == CLK_HRCFREQ_4)                    ||                         \
        ((SEL) == CLK_HRCFREQ_2)                    ||                         \
        ((SEL) == CLK_HRCFREQ_1))

/* Paramer valid check for LRC state */
#define IS_VALID_CLK_LRC_STATE(STA)                                            \
(       ((STA) == CLK_LRC_OFF)                      ||                         \
        ((STA) == CLK_LRC_ON))

/* Paramer valid check for system clock source */
#define IS_VALID_CLK_SYSCLK_SRC(SRC)                                           \
(       ((SRC) == CLK_SYSCLKSOURCE_HRC)             ||                         \
        ((SRC) == CLK_SYSCLKSOURCE_MRC)             ||                         \
        ((SRC) == CLK_SYSCLKSOURCE_LRC)             ||                         \
        ((SRC) == CLK_SYSCLKSOURCE_XTAL)            ||                         \
        ((SRC) == CLK_SYSCLKSOURCE_PLL))

/* Paramer valid check for HCLK clock divider */
#define IS_VALID_HCLK_DIV(DIV)                                                 \
(       ((DIV) == CLK_HCLK_DIV1)                    ||                         \
        ((DIV) == CLK_HCLK_DIV2)                    ||                         \
        ((DIV) == CLK_HCLK_DIV4)                    ||                         \
        ((DIV) == CLK_HCLK_DIV8)                    ||                         \
        ((DIV) == CLK_HCLK_DIV16)                   ||                         \
        ((DIV) == CLK_HCLK_DIV32)                   ||                         \
        ((DIV) == CLK_HCLK_DIV64))

/* Paramer valid check for PCLK1 clock divider */
#define IS_VALID_PCLK1_DIV(DIV)                                                \
(       ((DIV) == CLK_PCLK1_DIV1)                   ||                         \
        ((DIV) == CLK_PCLK1_DIV2)                   ||                         \
        ((DIV) == CLK_PCLK1_DIV4)                   ||                         \
        ((DIV) == CLK_PCLK1_DIV8)                   ||                         \
        ((DIV) == CLK_PCLK1_DIV16)                  ||                         \
        ((DIV) == CLK_PCLK1_DIV32)                  ||                         \
        ((DIV) == CLK_PCLK1_DIV64))

/* Paramer valid check for PCLK4 clock divider */
#define IS_VALID_PCLK4_DIV(DIV)                                                \
(       ((DIV) == CLK_PCLK4_DIV1)                   ||                         \
        ((DIV) == CLK_PCLK4_DIV2)                   ||                         \
        ((DIV) == CLK_PCLK4_DIV4)                   ||                         \
        ((DIV) == CLK_PCLK4_DIV8)                   ||                         \
        ((DIV) == CLK_PCLK4_DIV16)                  ||                         \
        ((DIV) == CLK_PCLK4_DIV32)                  ||                         \
        ((DIV) == CLK_PCLK4_DIV64))

/* Paramer valid check for ADC clock divider */
#define IS_VALID_ADCCLK_DIV(DIV)                                               \
(       ((DIV) == CLK_ADCCLK_PCLK4_DIV1)            ||                         \
        ((DIV) == CLK_ADCCLK_PCLK4_DIV2)            ||                         \
        ((DIV) == CLK_ADCCLK_PCLK4_DIV3)            ||                         \
        ((DIV) == CLK_ADCCLK_PCLK4_DIV4)            ||                         \
        ((DIV) == CLK_ADCCLK_PCLK4_DIV5)            ||                         \
        ((DIV) == CLK_ADCCLK_PCLK4_DIV6)            ||                         \
        ((DIV) == CLK_ADCCLK_PCLK4_DIV7)            ||                         \
        ((DIV) == CLK_ADCCLK_PCLK4_DIV8))

/* Parameter valid check for CLK MCO clock source. */
#define IS_VALID_CLK_MCOSOURCE(SOURCE)                                         \
(       ((SOURCE) == CLK_MCOSOURCCE_HRC)            ||                         \
        ((SOURCE) == CLK_MCOSOURCCE_MRC)            ||                         \
        ((SOURCE) == CLK_MCOSOURCCE_LRC)            ||                         \
        ((SOURCE) == CLK_MCOSOURCCE_XTAL)           ||                         \
        ((SOURCE) == CLK_MCOSOURCCE_PLLP)           ||                         \
        ((SOURCE) == CLK_MCOSOURCCE_HCLK)           ||                         \
        ((SOURCE) == CLK_MCOSOURCCE_SWDT))

/* Parameter valid check for CLK MCO clock Prescaler. */
#define IS_VALID_CLK_MCODIV(DIV)                                               \
(       ((DIV) == CLK_MCODIV_1)                     ||                         \
        ((DIV) == CLK_MCODIV_2)                     ||                         \
        ((DIV) == CLK_MCODIV_4)                     ||                         \
        ((DIV) == CLK_MCODIV_8)                     ||                         \
        ((DIV) == CLK_MCODIV_16)                    ||                         \
        ((DIV) == CLK_MCODIV_32)                    ||                         \
        ((DIV) == CLK_MCODIV_64)                    ||                         \
        ((DIV) == CLK_MCODIV_128))

