levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_clk.c
/* Parameter valid check for CLK stable flag. */
#define IS_VALID_CLK_STB_FLAG(flag)                                            \
(       ((flag) == CLK_FLAG_HRCSTB)                 ||                         \
        ((flag) == CLK_FLAG_PLLSTB)                 ||                         \
        ((flag) == CLK_FLAG_XTALSTB))

/* Parameter valid check for PLL clock source. */
#define IS_VALID_PLL_SRC(flag)                                                 \
(       ((flag) == CLK_PLL_SRC_HRC)                 ||                         \
        ((flag) == CLK_PLL_SRC_XTAL))

/*! Parameter validity check for pllp */
#define IS_PLL_DIV_VALID(pllp)                                                 \
(   (CLK_PLL_DIV_MIN        <=  (pllp))     &&                                 \
    (CLK_PLL_DIV_MAX        >=  (pllp)))

/*! Parameter validity check for plln */
#define IS_PLLN_VALID(plln)                                                    \
(   (CLK_PLLN_MIN           <=  (plln))     &&                                 \
    (CLK_PLLN_MAX           >=  (plln)))

/*! Parameter validity check for pllm*/
#define IS_PLLM_VALID(pllm)                                                    \
(   (CLK_PLLM_MIN           <=  (pllm))     &&                                 \
    (CLK_PLLM_MAX           >=  (pllm)))

/*! Parameter validity check for pllsource/pllm \a vco_in. */
#define IS_PLL_VCO_IN_VALID(vco_in)                                            \
(   (CLK_PLL_VCO_IN_MIN     <=  (vco_in))   &&                                 \
    (CLK_PLL_VCO_IN_MAX     >=  (vco_in)))

/*! Parameter validity check for pllsource/pllm*plln \a vco_out. */
#define IS_PLL_VCO_OUT_VALID(vco_out)                                          \
(   (CLK_PLL_VCO_OUT_MIN    <=  (vco_out))  &&                                 \
    (CLK_PLL_VCO_OUT_MAX    >=  (vco_out)))

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup CLK_Global_Functions CLK Global Functions
 * @{
 */
/**
  * @brief  Resets the CLK clock configuration to the default reset state.
  * @note   The default reset state of the clock configuration is given below:
  *            - LRC HRC ON and HRC used as system clock source
  *            - XTAL OFF
  *            - SysClk divider set to 1.
  *            - MCO OFF
  *            - PLL OFF
  *            - All interrupts disabled
  * @param  None
  * @retval None
  */
void CLK_DeInit(void)
{
    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    /* Reset peripheral clock */
    M4_CMU->FCG = 0xFFFFFFFFu;

    /* Reset system clock / HCLK divider */
    M4_CMU->SCFGR = 0x00000000U;
//    M4_CMU->PERICKSEL = 0x00U;

    /* Start the HRC clock */
    M4_CMU->HRCCR = 0x00U;
    while(1U == READ_REG8_BIT(M4_CMU->HRCCR, CMU_HRCCR_HRCSTP));

    /* Reset MCO */
    M4_CMU->MCOCFGR = 0x00U;

    /* Reset the system source */
    M4_CMU->CKSWR = 0x00U;

    /* Reset XTALSTD */
    M4_CMU->XTALSTDCR = 0x00U;

    /* Reset PLL */
    M4_CMU->PLLCR = 0x01U;

    /* Reset LRC MRC XTAL */
    M4_CMU->LRCCR = 0x00U;
    M4_CMU->MRCCR = 0x00U;
    M4_CMU->XTALCR = 0x01U;

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();
}

/**
 * @brief  Init Xtal initial structure with default value.
 * @param  pstcXtal specifies the paramer of XTAL.
 *            @arg    u8XtalState  : The new state of the XTAL.
 *            @arg    u8XtalMode   : The XTAL mode selection osc or exclk.
 *            @arg    u8XtalDrv    : The XTAL drive ability.
 *            @arg    u8XtalSupDrv : The XTAL super drive on or off.
 *            @arg    u8XtalStb    : The XTAL stable time selection.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t CLK_XtalStrucInit(stc_clk_xtal_init_t* pstcXtal)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcXtal)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcXtal->u8XtalState   = CLK_XTAL_OFF;
        pstcXtal->u8XtalMode    = CLK_XTALMODE_OSC;
        pstcXtal->u8XtalDrv     = CLK_XTALDRV_HIGH;
        pstcXtal->u8XtalSupDrv  = CLK_XTAL_SUPDRV_ON;
        pstcXtal->u8XtalStb     = CLK_XTALSTB_8;
    }

    return enRet;
}

/**
  * @brief  Initialise the XTAL.
  * @param  pstcXtal specifies the paramer of XTAL.
  *            @arg    u8XtalState  : The new state of the XTAL.
  *            @arg    u8XtalMode   : The XTAL mode selection osc or exclk.
  *            @arg    u8XtalDrv    : The XTAL drive ability.
  *            @arg    u8XtalSupDrv : The XTAL super drive on or off.
  *            @arg    u8XtalStb    : The XTAL stable time selection.
  * @retval en_result_t Status
  */
en_result_t CLK_XTALInit(const stc_clk_xtal_init_t* pstcXtal)
{
    uint32_t u32timeout = 0UL;
    en_result_t enRet = Ok;

    if (pstcXtal == NULL)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Paramers check */
        DDL_ASSERT(IS_VALID_CLK_XTAL_STATE(pstcXtal->u8XtalState));

        /* Enable register write. */
        CLK_REG_WRITE_ENABLE();

