levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_clk.c
    /* Check if pointer is NULL */
    if (NULL == pstcXtalStd)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcXtalStd->u8XtalStdState = CLK_XTALSTD_OFF;
        pstcXtalStd->u8XtalStdMode  = CLK_XTALSTD_MODE_INT;
        pstcXtalStd->u8XtalStdInt   = CLK_XTALSTD_RST_OFF;
        pstcXtalStd->u8XtalStdRst   = CLK_XTALSTD_INT_OFF;
    }

    return enRet;
}

/**
 * @brief  Initialise the XTAL status detection.
 * @param  pstcXtalStd specifies the paramer of XTALSTD.
 *            @arg    u8XtalStdState:   The new state of the XTALSTD.
 *            @arg    u8XtalStdMode:    The XTAL status detection occur interrupt or reset.
 *            @arg    u8XtalStdInt:     The XTAL status detection interrupt on or off.
 *            @arg    u8XtalStdRst:     The XTAL status detection reset on or off.
 * @retval None
 */
en_result_t CLK_XTALStdInit(const stc_clk_xtalstd_init_t* pstcXtalStd)
{
    en_result_t enRet = Ok;

    if (pstcXtalStd == NULL)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Paramer valid check */
        DDL_ASSERT(IS_VALID_CLK_XTALSTD_STATE(pstcXtalStd->u8XtalStdState));

        /* Enable register write. */
        CLK_REG_WRITE_ENABLE();

        if(CLK_XTALSTD_OFF == pstcXtalStd->u8XtalStdState)
        {
            /* Disbale XTAL status detection */
            CLEAR_REG8_BIT(M4_CMU->XTALSTDCR, CMU_XTALSTDCR_XTALSTDE);
        }
        else
        {
            /* Paramer valid check */
            DDL_ASSERT(IS_VALID_CLK_XTALSTD_MODE(pstcXtalStd->u8XtalStdMode));
            DDL_ASSERT(IS_VALID_CLK_XTALSTD_INT_STATE(pstcXtalStd->u8XtalStdInt));
            DDL_ASSERT(IS_VALID_CLK_XTALSTD_RST_STATE(pstcXtalStd->u8XtalStdRst));

            /* Confiure XTALSTD and enable XTALSTD */
            M4_CMU->XTALSTDCR = pstcXtalStd->u8XtalStdState | pstcXtalStd->u8XtalStdMode | \
                                pstcXtalStd->u8XtalStdInt   | pstcXtalStd->u8XtalStdRst;
        }
    }

    return enRet;
}

/**
 * @brief  Set the system clock source.
 * @param  u8Src specifies the source of system clock.
 *          This parameter can be one of the following values:
 *            @arg    CLK_SYSCLKSOURCE_HRC    : select HRC as system clock source
 *            @arg    CLK_SYSCLKSOURCE_XTAL   : select XTAL as system clock source
 *            @arg    CLK_SYSCLKSOURCE_LRC    : select LRC as system clock source
 *            @arg    CLK_SYSCLKSOURCE_MRC    : select MRC as system clock source
 *            @arg    CLK_SYSCLKSOURCE_PLL    : select PLL as system clock source
 * @retval None
 */
void CLK_SetSysclkSrc(uint8_t u8Src)
{
    DDL_ASSERT(IS_VALID_CLK_SYSCLK_SRC(u8Src));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    /* Set system clock divider */
    M4_CMU->CKSWR = u8Src;

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();

    /* Update system clock */
    SystemCoreClockUpdate();
}

/**
 * @brief  Set the system clock divider.
 * @param  pstcClkDivCfg The system clock configures struct.
 * @retval None
 */
void CLK_SetSysclkDiv(const stc_clk_div_cfg_t *pstcClkDivCfg)
{
    DDL_ASSERT(IS_VALID_HCLK_DIV(pstcClkDivCfg->u32HclkDiv));
    DDL_ASSERT(IS_VALID_PCLK1_DIV(pstcClkDivCfg->u32Pclk1Div));
    DDL_ASSERT(IS_VALID_PCLK4_DIV(pstcClkDivCfg->u32Pclk4Div));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    /* Set system clock divider */
    M4_CMU->SCFGR = pstcClkDivCfg->u32HclkDiv | pstcClkDivCfg->u32Pclk1Div | pstcClkDivCfg->u32Pclk4Div;

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();

    /* Update system clock */
    SystemCoreClockUpdate();
}

/**
 * @brief  Set the PCLK4 divider witch used as ADC clock.
 * @param  u8Div specifies the divider of PCLK4. @ref CLK_ADCCLK_Divider.
 * @retval None
 */
void CLK_SetADClkDiv(uint8_t u8Div)
{
    DDL_ASSERT(IS_VALID_ADCCLK_DIV(u8Div));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    /* Set system clock divider */
    M4_CMU->ADCKSEL = u8Div;

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();
}

/**
 * @brief  Enable or disable the FCG peripheral clock.
 * @note   After reset,the peripheral clock is disabled and the application
 *         software has to enable this clock before using it.
 * @param  u32FcgPeriph specifies the peripheral in FCG. @ref CLK_FCG_Peripheral_Control.
  *
 * @param  enNewState specifies the new state of the clock output.
 *          This parameter can be one of the following values:
 *            @arg Enable:   Enable clock output.
 *            @arg Disable:  Disable clock output.
 * @retval None
 */
void CLK_FcgPeriphClockCmd(uint32_t u32FcgPeriph, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    if(Enable == enNewState)
    {
        M4_CMU->FCG &= ~u32FcgPeriph;
    }
    else
    {
        M4_CMU->FCG |= u32FcgPeriph;
    }

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();
}

/**
 * @brief  Selects the clock source to output on MCO pin.
 * @note   P15 should be configured in alternate function mode.
 * @param  CLK_MCOSource specifies the clock source to output. @ref CLK_MCO_Clock_Source.
 * @param  CLK_MCODiv specifies the MCOx prescaler. @ref CLK_MCO_Clock_Prescaler.
 * @retval None
 */
void CLK_MCOConfig(uint8_t CLK_MCOSource, uint8_t CLK_MCODiv)
{
    /* Check the parameters. */
    DDL_ASSERT(IS_VALID_CLK_MCOSOURCE(CLK_MCOSource));
    DDL_ASSERT(IS_VALID_CLK_MCODIV(CLK_MCODiv));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    /* Configure the MCO and Enable MCO */
    M4_CMU->MCOCFGR = (CLK_MCODiv | CLK_MCOSource);

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();
}

/**
 * @brief  Enable or Disable MCO.
 * @param  enNewState specifies the new state of the clock output.
 *          This parameter can be one of the following values:
 *            @arg Enable:   Enable clock output.
 *            @arg Disable:  Disable clock output.
 * @retval None
 */
void CLK_MCOCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    /* Enable or disable clock output. */
    if(Enable == enNewState)
    {
        MODIFY_REG8(M4_CMU->MCOCFGR, CMU_MCOCFGR_MCO1EN, CMU_MCOCFGR_MCO1EN);
    }
    else
    {
        MODIFY_REG8(M4_CMU->MCOCFGR, CMU_MCOCFGR_MCO1EN, 0U);
    }

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();
}

/**
 * @brief  Clear the XTAL error flag.
 * @param  None
 * @retval None
 * @note   The system clock should not be XTAL before call this function.
 */
void CLK_ClearXtalStdFlag(void)
{
    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    if(CMU_XTALSTDSR_XTALSTDF == M4_CMU->XTALSTDSR)
    {
        /* Clear the XTAL STD flag */
        CLEAR_REG8_BIT(M4_CMU->XTALSTDSR, CMU_XTALSTDSR_XTALSTDF);
    }

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();
}
/**
 * @brief  Get the clock stable flag.
 * @param  u8Flag  specifies the clock stable flag. @ref CLK_STB_Flag
 * @retval en_flag_status_t
 */
en_flag_status_t CLK_GetStableFlag(uint8_t u8Flag)
{
    en_flag_status_t enFlagStatus = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_CLK_STB_FLAG(u8Flag));

    if (Reset != (READ_REG8_BIT(M4_CMU->OSCSTBSR, u8Flag)))
    {
        enFlagStatus = Set;
    }

    return enFlagStatus;
}

/**
 * @brief  Select pll clock source.
 * @param  [in] u32PllSrc               The pll clock source. @ref CLK_PLL_Clock_Source
 * @retval None
 */
void CLK_SetPllSource(uint32_t u32PllSrc)
{
    DDL_ASSERT(IS_VALID_PLL_SRC(u32PllSrc));

