levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_clk.c
    CLK_REG_WRITE_ENABLE();

    MODIFY_REG32(M4_CMU->PLLCFGR, CMU_PLLCFGR_PLLSRC, u32PllSrc);

    CLK_REG_WRITE_DISABLE();
}

/**
 * @brief  Configures the PLL.
 * @param  [in] pstcPllCfg            The PLL configures struct.
 * @retval None
 */
void CLK_PllConfig(const stc_clk_pll_cfg_t *pstcPllCfg)
{
#ifdef __DEBUG
    uint32_t vcoIn = 0ul;
    uint32_t vcoOut = 0ul;
#endif /* #ifdef __DEBUG */

    if(NULL != pstcPllCfg)
    {
        DDL_ASSERT(IS_PLL_DIV_VALID(pstcPllCfg->PllpDiv));
        DDL_ASSERT(IS_PLLN_VALID(pstcPllCfg->plln));
        DDL_ASSERT(IS_PLLM_VALID(pstcPllCfg->pllmDiv));

#ifdef __DEBUG
        vcoIn = ((CLK_PLL_SRC_XTAL == READ_REG32_BIT(M4_CMU->PLLCFGR, CMU_PLLCFGR_PLLSRC) ?
                XTAL_VALUE : HRC_VALUE) / pstcPllCfg->pllmDiv);
        vcoOut = vcoIn * pstcPllCfg->plln;

        DDL_ASSERT(IS_PLL_VCO_IN_VALID(vcoIn));
        DDL_ASSERT(IS_PLL_VCO_OUT_VALID(vcoOut));
#endif /* #ifdef __DEBUG */

        CLK_REG_WRITE_ENABLE();

        MODIFY_REG32(M4_CMU->PLLCFGR,
                     CMU_PLLCFGR_PLLM|CMU_PLLCFGR_PLLN|CMU_PLLCFGR_PLLP,
                     ((pstcPllCfg->PllpDiv-1U)<<CMU_PLLCFGR_PLLP_POS)
                      |((pstcPllCfg->plln-1U)<<CMU_PLLCFGR_PLLN_POS)
                      |((pstcPllCfg->pllmDiv-1U)<<CMU_PLLCFGR_PLLM_POS));

        CLK_REG_WRITE_DISABLE();
    }
    else
    {
        /* code */
    }
}

/**
 * @brief  Enable or disable the MPLL.
 * @param  [in] enNewState             The new state of the MPLL.
 * @arg    Enable                      Enable MPLL.
 * @arg    Disable                     Disable MPLL.
 * @retval en_result_t
 * @note   MPLL can not be stopped if it is used as system clock source.
 */
en_result_t CLK_PllCmd(en_functional_state_t enNewState)
{
    __IO uint32_t timeout = 0ul;
    en_flag_status_t status;
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    CLK_REG_WRITE_ENABLE();

    if(Disable == enNewState)
    {
        if(CLK_SYSCLKSOURCE_PLL == M4_CMU->CKSWR)
        {
            enRet = Error;
        }
        else
        {
            SET_REG8_BIT(M4_CMU->PLLCR, CMU_PLLCR_PLLOFF);
        }
    }
    else
    {
        CLEAR_REG8_BIT(M4_CMU->PLLCR, CMU_PLLCR_PLLOFF);
        do
        {
            status = CLK_GetStableFlag(CLK_FLAG_PLLSTB);
            timeout++;
        }while((timeout < CLK_PLL_TIMEOUT) && (status != Set));
    }

    CLK_REG_WRITE_DISABLE();

    return enRet;
}

static uint32_t u32HrcFreqTable_0[6U] = {64*1000000, 32*1000000, 16*1000000,
                                         8*1000000, 4*1000000, 2*1000000};

static uint32_t GetHrcFreq(void)
{
    uint32_t u32Freq;

    u32Freq = u32HrcFreqTable_0[READ_REG8_BIT(M4_CMU->HRCCFGR, CMU_HRCCFGR_HRCFREQS_0|CMU_HRCCFGR_HRCFREQS_1|CMU_HRCCFGR_HRCFREQS_2)];

    if(CMU_HRCCFGR_HRCFREQS_3 == READ_REG8_BIT(M4_CMU->HRCCFGR, CMU_HRCCFGR_HRCFREQS_3))
    {
    }
    else
    {
        u32Freq = u32Freq*3U/4U;
    }
    return u32Freq;
}

/**
 * @brief  Get clock frequency.
 * @param  [in] pstcClkFreq            The clock source struct.
 * @retval The clock frequency include system clock,hclk,exck,pclk0,pclk4.
 *
 * @note   None
 */
void CLK_GetClockFreq(stc_clk_freq_t *pstcClkFreq)
{
    uint32_t plln = 0u, pllp = 0u, pllm = 0u, pllsource = 0u;
    uint32_t u32HrcFreq;

    u32HrcFreq = GetHrcFreq();
    if(NULL != pstcClkFreq)
    {
        /* Get system clock. */
        switch(READ_REG8_BIT(M4_CMU->CKSWR, CMU_CKSWR_CKSW))
        {
            case CLK_SYSCLKSOURCE_HRC:
                /* HRC used as system clock. */
                pstcClkFreq->sysclkFreq = u32HrcFreq;
                break;
            case CLK_SYSCLKSOURCE_MRC:
                /* MRC used as system clock. */
                pstcClkFreq->sysclkFreq = MRC_VALUE;
                break;
            case CLK_SYSCLKSOURCE_LRC:
                /* LRC used as system clock. */
                pstcClkFreq->sysclkFreq = LRC_VALUE;
                break;
            case CLK_SYSCLKSOURCE_XTAL:
                /* XTAL used as system clock. */
                pstcClkFreq->sysclkFreq = XTAL_VALUE;
                break;
            default:
                /* PLL used as system clock. */
                pllsource = READ_REG32_BIT(M4_CMU->PLLCFGR, CMU_PLLCFGR_PLLSRC);

                pllp = (READ_REG32_BIT(M4_CMU->PLLCFGR, CMU_PLLCFGR_PLLP) >> CMU_PLLCFGR_PLLP_POS);
                plln = (READ_REG32_BIT(M4_CMU->PLLCFGR, CMU_PLLCFGR_PLLN) >> CMU_PLLCFGR_PLLN_POS);
                pllm = (READ_REG32_BIT(M4_CMU->PLLCFGR, CMU_PLLCFGR_PLLM) >> CMU_PLLCFGR_PLLM_POS);

                /* PLLCLK = ((pllsrc / pllm) * plln) / pllp */
                if (CLK_PLL_SRC_XTAL == pllsource)
                {
                    pstcClkFreq->sysclkFreq = (XTAL_VALUE)/(pllm+1u)*(plln+1u)/(pllp+1u);
                }
                else if (CLK_PLL_SRC_HRC == pllsource)
                {
                    pstcClkFreq->sysclkFreq = (u32HrcFreq)/(pllm+1u)*(plln+1u)/(pllp+1u);
                }
                else
                {
                    //else
                }
                break;
        }

        /* Get hclk. */
        pstcClkFreq->hclkFreq = pstcClkFreq->sysclkFreq >> (READ_REG32_BIT(M4_CMU->SCFGR, CMU_SCFGR_HCLKS)>>CMU_SCFGR_HCLKS_POS);

        /* Get pclk1. */
        pstcClkFreq->pclk1Freq = pstcClkFreq->sysclkFreq >> (READ_REG32_BIT(M4_CMU->SCFGR, CMU_SCFGR_PCLK1S)>>CMU_SCFGR_PCLK1S_POS);

        /* Get pclk4. */
        pstcClkFreq->pclk4Freq = pstcClkFreq->sysclkFreq >> (READ_REG32_BIT(M4_CMU->SCFGR, CMU_SCFGR_PCLK4S)>>CMU_SCFGR_PCLK4S_POS);
    }
    else
    {
        /* code */
    }
}

/**
 * @}
 */

#endif /* DDL_CLK_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
